In [1]:
import pandas as pd
import numpy as np
import os

from tqdm import tqdm_notebook

import tensorflow as tf

from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense, Activation, Flatten, Reshape, Conv2D, Conv2DTranspose, UpSampling2D
from tensorflow.keras.layers import LeakyReLU, Dropout, ReLU, BatchNormalization, InputLayer, Concatenate
from tensorflow.keras.optimizers import Adam, RMSprop

## API usage

In [3]:
import fict_api as fapi

In [5]:
countries = np.loadtxt('countries.txt', dtype=int)
env = fapi.Environment(countries)

Generating time_to_planes dataset...
Generating country_to_hotels dataset...

HBox(children=(FloatProgress(value=0.0, max=247.0), HTML(value='')))

Done

To run example of using env use the code below

In [6]:
time1 = pd.to_datetime('28/8/2020')
time2 = pd.to_datetime('29/8/2020')

env.get_hotels(4, time1, time2)

                name  day_price available_from available_to
1    Alpha_hotel_501       4834     2020-08-16   2020-08-31
21   Super_hotel_521       9522     2020-08-20   2020-09-12
22   Alpha_hotel_522       4617     2020-08-12   2020-09-13
25   Alpha_hotel_525       1695     2020-08-09   2020-09-26
29    Mega_hotel_529       3908     2020-08-23   2020-09-27
..               ...        ...            ...          ...
466  Alpha_hotel_966       8616     2020-08-12   2020-09-22
485   Mega_hotel_985       6039     2020-08-06   2020-08-30
486  Super_hotel_986       8164     2020-08-15   2020-09-13
488   Mega_hotel_988       7190     2020-08-02   2020-09-04
489  Super_hotel_989       3784     2020-08-16   2020-09-11

[87 rows x 4 columns]

In [7]:
env.get_tickets(time1, time2)

            price  from   to
time
2020-08-28  17702   705  580
2020-08-28  25538    20  434
2020-08-28  24646   156  630
2020-08-28   9976   580  364
2020-08-28   6763   508  772
...           ...   ...  ...
2020-08-29  26626   616  670
2020-08-29  15643   434  231
2020-08-29   6053   418  620
2020-08-29  31955    44   84
2020-08-29  23855   414  288

[1000 rows x 3 columns]

## NN usage

In [8]:
import prediction

net = prediction.NN(True)

full_predict = net.G.predict(net.user_data.values.astype('float32'))

Data imported...
Weights loaded

## Parser Usage

In [9]:
cities_ = pd.read_csv('cities.csv')
cities_

,Unnamed: 0,CNTRY_CODE,NAME,NAME_R,CAPITAL,LAT,LON
0,0,895.0,Abkhazia,Абхазия,NaN,NaN,NaN
1,1,4.0,Afghanistan,Афганистан,Кабул,34.53278,69.16583
2,2,8.0,Albania (Republic of),Албания,Тирана,41.33000,19.82000
3,3,12.0,Algeria (People`s Democratic Republic of),Алжир,Алжир,27.25000,3.45000
4,4,16.0,American Samoa,Американское (Восточное) Самоа,Паго-Паго,-14.27306,-170.70278
...,...,...,...,...,...,...,...
242,242,732.0,Western Sahara,Западная Сахара,NaN,NaN,NaN
243,243,887.0,Yemen (Republic of),Йемен,Сана,15.35000,44.20000
244,244,894.0,Zambia (Republic of),Замбия,Лусака,-15.41667,28.28333
245,245,716.0,Zimbabwe (Republic of),Зимбабве,Хараре,-17.86389,31.02972
246,246,NaN,nonterestrial,Спутниковые сети,NaN,NaN,NaN